posts/in-silence.org
#+title: In Silence
#+date: <2019-12-03>
#+FILETAGS: :Faith:

#+begin_quote
For God alone my soul in silence waits; from him comes my salvation.
(Psalm 62:1 BCP)
#+end_quote

Today the church remembers St. Francis Navier. He wrote to Ignatius
that more evangelists were needed to tell those in Asia about Jesus.
He believed there were people just waiting to hear the good news.
Reading Psalm 62, I can say They are waiting for God alone. 

I often think of the people at the time of Jesus as waiting in
silence. Perhaps this is because of Slent Night or perhaps because we
have the Scripture about the people sitting in darkness which implies silence to me. In any event Francis reminds us that many are just waiting to hear our words of forgiveness, love and salvation.
