in-silence.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://example.com/rss.xml"
      title="RSS feed for https://example.com/">
<title>In Silence</title>
</head>
<body>
<div id="preamble" class="status"></div>
<div id="content">
<div class="post-date">03 Dec 2019</div><h1 class="post-title"><a href="https://example.com/in-silence.html">In Silence</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgca15fb3">1. In Silence</a></li>
</ul>
</div>
</nav>
<div id="outline-container-orgca15fb3" class="outline-2">
<h2 id="orgca15fb3"><span class="section-number-2">1.</span> In Silence</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
For God alone my soul in silence waits; from him comes my salvation.
(Psalm 62:1 BCP)
</p>
</blockquote>

<p>
Today the church remembers St. Francis Navier. He wrote to Ignatius
that more evangelists were needed to tell those in Asia about Jesus.
He believed there were people just waiting to hear the good news.
Reading Psalm 62, I can say They are waiting for God alone. 
</p>

<p>
I often think of the people at the time of Jesus as waiting in
silence. Perhaps this is because of Slent Night or perhaps because we
have the Scripture about the people sitting in darkness which implies silence to me. In any event Francis reminds us that many are just waiting to hear our words of forgiveness, love and salvation.
</p>
</div>
</div>
<div class="taglist"></div></div>
<div id="postamble" class="status"></div>
</body>
</html>
